Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this zone.
Remarks:
This unique id can be passed to the Document.GetElement(string) method.
CADObjectUniqueId is unrelated to the CADObjectId element in gbxml.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.UseAirChangesPerHour
Use the air changes per hour.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.AirChangesPerHour
The outside air rate or air changes per hour as a number between 0 and 10000.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.UseOutsideAirPerArea
Use the outside air per area.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.OutsideAirPerArea
The outside air per area in unit ft/s.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.UseOutsideAirPerPerson
Use the outside air per person.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.OutsideAirPerPerson
The outside air per person in unit ft3/s.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.DehumidificationSetPoint
The dehumidification set point as a number between 0 and 1.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.HumidificationSetPoint
The humidification set point as a number between 0 and 1.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.UseDehumidificationSetPoint
Use the dehumidification set point.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.UseHumidificationSetPoint
Use the humidification set point.
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.CoolingAirTemperature
The cooling air temperature in unit Kelvin (K).
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.HeatingAirTemperature
The cooling air temperature in unit Kelvin (K).
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.CoolingSetPoint
The cooling temperature set point in unit Kelvin (K).
Since:
2026

Autodesk.Revit.DB.Analysis.EnergyAnalysisZone.HeatingSetPoint
The heating temperature set point in unit Kelvin (K).
Since:
2026